v2512/run/fcn-krxn/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2512                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application         simpleFoam;
startFrom           latestTime;
startTime           0;
stopAt              endTime;
endTime             100;
deltaT              1;
writeControl        timeStep;
writeInterval       50;
purgeWrite          0;
writeFormat         ascii;
writePrecision      12;
writeCompression    off;
timeFormat          general;
timePrecision       12;
runTimeModifiable   yes;

libs
(
    "libexternalSpecieDiffusionResistance.so"
);

functions
{
    #include "FO_createScalarFields"
    #include "FO_scalarTransport"
    #include "FO_writeData"
}

// ************************************************************************* //